#

# ------------------------------------------------------
# ---------- 【产品依赖包】 ------------------------------
# ------------------------------------------------------

# 以下均为须采用特定版本的【产品依赖包】。
# 暂无。



# 以下均为可采用 latest 版本的【产品依赖包】。顺便提醒，虽然一般而言 latest 版本应恰为最高版本，但并不确保。
npm i `
    '@wulechuan/css-stylus-markdown-themes@latest' `
    '@wulechuan/generate-html-via-markdown@latest' `
    'plugin-error@latest' `
    'replace-ext@latest' `
    'through2@latest'





# ------------------------------------------------------
# ---------- 【研发依赖包】 ------------------------------
# ------------------------------------------------------
# 以下均为须采用特定版本的【研发依赖包】。
# 暂无。



# 以下均为可采用 latest 版本的【研发依赖包】。顺便提醒，虽然一般而言 latest 版本应恰为最高版本，但并不确保。
npm i -D `
    '@wulechuan/cli-scripts--git-push@latest' `
    'eslint@latest' `
    'gulp@latest'
